--تمت كتابه الملف بواسطه المطور @iq_313k
--تمت الزخرفه بواسطه@IxXx_56_xXxI
do 

local function run(msg, matches) 

if matches[1]=="سمايل" and is_sudo(msg) then 

return  "نہٰٰٰٖٖٖعہٰٰٰٖٖٖمہ حہٰٰٰٖٖٖحۘـۣــﺒﻴۘﺒﻴـہۛ الہٰٰٰٖٖٖمہٰٰٰٖٖٖطہٰٰٰٖٖٖﮧ୭ر ┆ 🌝💗👐🏿" 

elseif matches[1]=="هلو" or matches[1]== "هلوو" or matches[1]== "هلا" or matches[1]== "هلووو" then 

return  "هلُۆآتٌ حٍـيَـ{ლ}ـآتٌيَ┆✨😽💞" 

elseif matches[1]=="السلام عليكم" or matches[1]== "السلام" or matches[1]== "سلام عليكم" or matches[1]== "سلام" then 

return  "ﯛ୭ﯠ۶ـہٰٰٰٖٖٖلہٰٰٰٖٖٖيکگہٰٰٰٖٖٖمہٰٰٰٖٖٖہ ٵٴلہٰٰٰٖٖٖسہلہٰٰٰٖٖٖاٴمہٰٰٰٖٖٖہ ┆ 😸➰✌️🏿" 

elseif matches[1]=="الحمدلله" or matches[1]== "الحمد لله" or matches[1]== "تمام" or matches[1]== "زين" then 

return  " عســاها دو{مـو يـوم}وم┋ 💜'ء " 

elseif matches[1]=="مرحبا" then 

return  " هلُۆآتٌ حٍـيَـ{ლ}ـآتٌيَ┆✨😽💞 " 

elseif matches[1]=="هاي" then 

return  " هـايـات يـروحـي┋🌸😻'ء " 

elseif matches[1]=="شلونكم" or matches[1]== "شخباركم" or matches[1]== "صحتكم" or matches[1]== "شلونك"or matches[1]== "شونك" then 

return  "نہٰٰٰٖٖٖيہٰٰٰٖٖٖـہ﴿💜﴾ـﮯ ډٵٰہٰيٰہٰٰٰٖٖٖہٰٰٰٖٖٖحہٰٰٰٖٖٖہ شـﮧ̯͡୭فہٰٰٰٖٖٖہ بقيـهہ ٵٴلہٰٰٰٖٖٖآ۶ٰٰٰٖٖٖـضَّـﮧ̯͡اء ┆ 🌝💔 " 

elseif matches[1]=="بوت" then 

return  "آٰٰٰٖٖٖسٰٰٰۣٖٖٖۛہٰٰٰٖٖٖمـ﴿💜﴾ـہٰٰٰٖٖٖـﮯ سہٰٰٰٖٖٖمہٰٰٰٖٖٖﮧ̯͡آيہٰٰٰٖٖٖلہٰٰٰٖٖٖہ┆🙊💗👐🏿" 

elseif matches[1]=="هلاو" then 

return  "هلُۆآتٌ حٍـيَـ{ლ}ـآتٌيَ┆✨😽💞" 

elseif matches[1]=="اسكت" then 

return  "פکٰکٰٰہہٰٰٰٖٖٖيٰ💰☻ مہٰٖٖٖ؏ـہٰٰٰٖٖٖلمہ║😽🌸ֆ" 

elseif matches[1]=="🌚" then 

return  "ﻣنـــﯛﺭ┊💗♔ صہٰٰٰٖٖٖخہٰٰٰٖٖٖـﮧٱمہٰٰٰٖٖٖہ ، ‹‹ ٱٰٰٰٖٖٖلہٰٰٰٖٖٖجہـﮧٰٰٰٖٖٖدر ┆ 😹👐🏿 " 

elseif matches[1]=="زاحف" then 

return  "زٱٰٰٰٖٖٖحہٰٰٰٖٖٖحفہٰٰٰٖٖٖہ ۶ـہٰٰٰٖٖٖلہٰٰٰٖٖٖـﮯ خہٰٰٰٖٖٖخہـﮧٰٰٰ̯ٖٖٖ͡آٰٰٰٖٖٖلہٰٰٰٖٖٖتہٰٰٰٖٖٖکگ الہٰٰٰٖٖٖشہٰٰٰٖٖٖکگہٰٰٰٖٖٖرهہة┆🌝👐🏿" 

elseif matches[1]=="باي" then 

return  " اﻟﻟـﮧ' ويـاك حيـاتي┋💛💭ء " 

elseif matches[1]=="اكرهك" then 

return  " ﭘــﺱ انـﻲ احبـک┋😞💖ء " 

elseif matches[1]=="تكرهني" then 

return  " طـبعاً مـا اكـرهك ¦ 😹✨'ء "

elseif matches[1]=="حلو" then 

return   "نہٰٰٰٖٖٖتہٰٰٰٖٖٖہۛ ٰ،ֆ ٱٰٰٰٖٖٖلہٰٰٰٖٖٖآحہٰٰٰٖٖٖحہٰٰٰٖٖٖلہٰٰٰٖٖٖـْﮯ┆🙎🏾💗"

elseif matches[1]=="🤔"  then 

return  "لـيـروح بالك بعـيد┆💫🌝🌹"

elseif matches[1]=="اريد بوت"  then 

return  " راسـل المطـور ¦ 😻☄️ء \n💡¦ المطـور : @iq_100K"

elseif matches[1]==" مح" or matches[1]== "محح" or matches[1]== "بوسه" then

return  "مہٰٰٰٖٖٖحـﮧٰٰٰٖٖٖ̯ۛ͡آٰٰٰٖٖٖتہٰٰٰٖٖٖہ פــۛ💜ـياتيُـ┆🙊👄"

elseif matches[1]=="🙄"  or matches[1]== "🙄🙄"  then 

return "مـۧـہۛﯙ بــ̲̐س̯͡ہ اඋـبَـ﴿ٌ💜﴾ــك͡ۂ!جہٰٰٰٖٖٖہ ۾ۛـ̲̐ـہ💜ـوتنـﮯ||Ֆء ۶ــلـيہٰٰٰٖٖٖکگﮧ ، ヅ ┆ 🙊🌸"

elseif matches[1]=="😒"  or matches[1]== "😒😒"  or matches[1]== "😒😒😒" then 

return  "شہٰٰٰٖٖٖبـيہٰٰٰٖٖٖكہٰٰٰٖٖٖڪ!جہٰٰٰٖٖٖہ ֆعہٰٰٰٖٖٖمہٰٰٰٖٖٖ୭┆✨🤔🍃"

elseif matches[1]=="🙈"  or matches[1]== "🙈🙈"  or matches[1]== "🙊"  or matches[1]== "🙊🙊" then 

return  "فہٰٰٰٖٖٖـﮧديہٰٰٰٖٖٖہ﴿💜﴾ـہٰٰٰٖٖٖتہ الہٰٰٰٖٖٖخہٰٰٰٖٖٖجہٰٰٰٖٖٖـﮧﯢّلہٰٰٰٖٖٖہ ֆ، ┆ 🙊✨"

elseif matches[1]=="احبك" then 

return   "مـۧـہۛﯙ بــ̲̐س̯͡ہ اඋـبَـ﴿ٌ💜﴾ــك͡ۂ!جہٰٰٰٖٖٖہ ۾ۛـ̲̐ـہ💜ـوتنـﮯ۪۪۪۫۫۫||Ֆء ۶ــلـيہٰٰٰٖٖٖکگﮧ ، ヅ ┆ 🙊🌸"
 
elseif matches[1]=="😞" or matches[1]== "☹️" or matches[1]== "☹️☹️" or matches[1]== "😔" or matches[1]== "😔😔" or matches[1]== "😔😔😔" or matches[1]== "" or matches[1]== "😔😔😔😔" or matches[1]== "😔😔😔😔" then 

return  "شبيه الحلو ضايج🌝💞"

elseif matches[1]=="😐" then 

return  "شہٰٰٰٖٖٖبـيہٰٰٰٖٖٖكہٰٰٰٖٖٖڪۂ ֆ“ ٰ😩👐🏿 صہٰٰٰٖٖٖہٰٰٰٖٖٖہٰٰٰٖٖٖـﮧ̯͡افہٰٰٰٖٖٖنہٰٰٰٖٖٖہ ┆ 😾🖕🏿"

elseif matches[1]=="غني" or matches[1]== "غنيلي" or matches[1]== "غنيي" then 

return  "عمي يبو البار 🤓☝🏿️ صبلي لبلبي ترى اني سكران 😌  وصاير عصبي 😠 انه وياج يم شامه 😉 وانه ويــــاج يم شامه  شد شد  👏🏿👏🏿 عدكم سطح وعدنه سطح 😁 نتغازل لحد الصبح 😉 انه وياج يم شامه 😍 وانه وياج فخريه وانه وياج حمديه 😂🖖🏿"

elseif matches[1]=="دي" then 

return  "ديييات🌝💫"

elseif matches[1]=="💦" or matches[1]== "💦💦" or matches[1]== "💦💦💦" or matches[1]== "💦💦💦💦" or matches[1]== "تف عليك" or matches[1]== "تف" or matches[1]== "تتف"  then 

return  "مہٰٰٰٖٖٖيہٰٰٰٖٖٖيہٰٰٰٖٖٖہ﴿💗💧﴾ـﮯ ֆ ” ، ورﺩ̲ﮧ🌸ֆ“ ┆🙎🏾➰💔"

elseif matches[1]=="😍" or matches[1]== "😍😍" or matches[1]== "😍😍😍" or matches[1]== "😍😍😍😍" then 

return  "مۛہۛحۛہۛحۛہۛ  ♯💗"

elseif matches[1]=="بايات" then 

return  " مہٰٰٰٖٖٖالہٰٰٰٖٖٖہ﴿💜﴾ـہٰٰٰٖٖٖہ دڕجہٰٰٰٖٖٖہ ֆ┆🙋🏿♂💗" 

else 

return  "نہٰٰٰٖٖٖعہٰٰٰٖٖٖمہٰٰٰٖٖٖہ ﺣﺤۘـۣــﺒﻴۘﺒﻴـہۛ آٰٰٰٖٖٖمہٰٰٰٖٖٖـﮧ̯͡رنہٰٰٰٖٖٖيـﮯ┆ 😼➰💗" 

end 

end 

return { 

  patterns = { 

  "^(سمايل)$", 

"^(سلام)$",

"^(سلام عليكم)$",

"^(السلام)$",

"^(هلو)$", 

"^(هلوو)$",

"^(هلا)$",

"^(هلووو)$",

"^(زين)$",

"^(تمام)$",

"^(شخباركم)$",

"^(الحمدلله)$", 

"^(الحمد لله)$", 

"^(مرحبا)$", 

"^(هاي)$", 

"^(شلونكم)$", 

"^(بوت)$", 

"^(هلاو)$", 

"^(🌚)$", 

"^(سلام)$", 

"^(زاحف)$", 

"^(باي)$", 

"^(اكرهك)$", 

"^(تكرهني)$", 

"^(اعشقك)$", 

"^(شخباركم)$", 

"^(اريد بوت)$", 

"^(مح)$",

"^(محح)$",

"^(بوسه)$",

"^(🙄)$",

"^(🙄🙄)$",

"^(اسكت)$",

"^(😒)$",

"^(😒😒)$",

"^(😒😒😒)$",

"^(🙈)$",

"^(🙈🙈)$",

"^(🙊)$",

"^(🙊🙊)$",

"^(😞)$",

"^(☹️)$",

"^(☹️☹️)$",

"^(😔)$",

"^(😔😔)$",

"^(😐)$",

"^(غني)$",

"^(غنيلي)$",

"^(غنيي)$",

"^(دي)$",

"^(💦)$",

"^(💦💦)$",

"^(💦💦💦)$",

"^(💦💦💦💦)$",

"^(تف)$",

"^(تفف)$",

"^(تف عليك)$",

"^(😍)$",

"^(😍😍)$",

"^(😍😍😍)$",

"^(😍😍😍😍)$",

"^(حلو)$",

"^(بايات)$", 

    }, 

  run = run 

} 

end --By @iq_313k

